Tekla Open API Reference for Tekla Structures 2025
ErrorDialog Class
 The ErrorDialog class represents the common error dialog for the Open API.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.Form
 Tekla.Structures.Dialog.ErrorDialog
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class ErrorDialog : Form
Public NotInheritable Class ErrorDialog
	Inherits Form
Methods
Name | Description
Show(Exception, ErrorDialog.Severity)
 Shows a new error dialog.
Show(String, List<String>, ErrorDialog.Severity)
 Shows a new error dialog.
Show(String, String, ErrorDialog.Severity)
 Shows a new error dialog.
Top
See Also
Reference
Tekla.Structures.Dialog Namespace